Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །གལ་ཏེ་སྡང་བའི་སེམས་དང་ལྡན་པ་ཐམས་ཅད་ཀྱིས་གླིང་བཞི་པ་གང་བར་གྱུར་ཀྱང་སྐྱོར་ཆུ་གཅིག་གིས་ཐམས་ཅད་དེའི་མོད་ཁོ་ན་ལ་མེད་པར་འགྱུར་རོ།
en: Even if all those hostile beings were to fill the four continents, a single handful of water would immediately annihilate them all.

source: །གལ་ཏེ་ཆུ་རྙོག་པ་ཅན་གྱིས་རྒྱ་མཚོ་བཞི་ཡོངས་སུ་གང་བར་གྱུར་ཀྱང་རུང་། སྐྱོར་ཆུ་གཅིག་ཁོ་ནས་རབ་ཏུ་དང་བར་བྱེད་དེ།
en: Even if the four oceans were entirely filled with murky water, a single handful of water would immediately make that water completely clear.

source: འདི་ལ་ཐེ་ཙོམ་མེད་ཀྱིས་ལོང་ལ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་སོང་ཤིག །
en: There are no doubts about this, so take it with you, and go to the buddha realm of Sahā!”

source: ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པས་ཚིག་འཐུན་པར་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། འདུས་པ་ཆེན་པོ་བལྟ་བ་དང་། ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་སེམས་ཅན་རྣམས་ཀྱི་ལས་འབྱང་བའི་གཟུངས་སྔགས་དེ་ཡང་མཉན་པར་འཚལ་ལགས་ན།
en: At that moment, the innumerable and limitless bodhisattvas exclaimed in unison, “Respected Blessed One, we also wish to behold the thus-gone Śākyamuni, to pay homage to him, to revere him, to behold his great assembly, and to listen to the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the domain of the nāgas, the dhāraṇī mantra that cleanses the karmic actions of sentient beings!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་དེར་བདག་ཀྱང་མཆིར་གནང་བ་ལྟ་ན་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་བདག་ཅག་མཆི་ལགས་སོ། །
en: Respected Blessed One, if you grant your permission, we will also go to the buddha realm of Sahā!”

source: དེ་ནས་དེ་དག་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་དེས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The blessed thus-gone Glorious Essence of Flowers replied to them,

source: །རིགས་ཀྱི་བུ་དག་ཁྱེད་ཐམས་ཅད་སོ་སོ་ནས་གླིང་བཞི་པའི་འཁོར་ལོས་སྒྱུར་བའི་ཆ་བྱད་དང་། རྟགས་དང་། དབྱིབས་དང་། ཡོ་བྱད་དང་། སྤྱོད་ལམ་གྱིས་ལྷན་ཅིག་འཐུན་པར་དེང་ཤིག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་པོ་དེ་དག་ཐམས་ཅད་གླིང་བཞི་པའི་འཁོར་ལོས་སྒྱུར་བའི་ཆ་བྱད་དང་། རྟགས་དང་། དབྱིབས་དང་། ཡོ་བྱད་དང་། སྤྱོད་ལམ་མངོན་པར་སྤྲུལ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་ལ་སོགས་པ་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོའི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ནམ་མཁའ་ལ་འཁོད་དོ། །
en: “Noble sons, all of you please proceed together while adopting the attire, marks, shape, implements, and behavior of universal monarchs ruling over the four continents.” All those eight hundred million bodhisattvas then transformed themselves to have the attire, marks, shape, implements and behavior of universal monarchs ruling over the four continents. Then, the bodhisattva Ākāśagarbha and all the other bodhisattvas bowed their heads to the feet of the thus-gone Glorious Essence of Flowers, circumambulated him three times, and rested in the sky.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རེ་རེས་ཀྱང་རིན་པོ་ཆེ་ལས་བྱས་པའི་པད་མ་འདབ་མ་སྟོང་པ་བདུན་བདུན་དང་། དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་ཡང་མངོན་པར་སྤྲུལ་ཏོ།
en: Each bodhisattva great being also manifested seven lotuses, each with a thousand petals made of precious gems, as well as the four kinds of troops.

source: །སྤྱོད་ལམ་དེ་ལྟ་བུས་དེ་ནས་ཆས་ཏེ། དེ་དག་ཐམས་ཅད་སྐད་ཅིག་ཐང་ཅིག་གཅིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་འཁོད་དེ།
en: They departed in this manner and instantaneously arrived in this buddha realm of Sahā.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་དུ་ཁ་ཅིག་གིས་ནི་གསེར་གྱི་ཕྱེ་མའི་ཆར་མངོན་པར་རབ་ཏུ་ཕབ་བོ། །
en: Some of them showered a rain of gold powder everywhere in the buddha realm of Sahā in order to worship the blessed thus-gone Śākyamuni and his bodhisattvas.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་ཁ་ཅིག་གིས་ནི་དངུལ་གྱི་ཕྱེ་མའི་ཆར་མངོན་པར་རབ་ཏུ་ཕབ་བོ། །ཁ་ཅིག་གིས་ནི་སྤོས་ཀྱི་ཕྱེ་མའི་ཆར་མངོན་པར་རབ་ཏུ་ཕབ་བོ། །ཁ་ཅིག་གིས་ནི་མུ་ཏིག་གི་ཆར་མངོན་པར་རབ་ཏུ་ཕབ་བོ། །ཁ་ཅིག་གིས་ནི་གསེར་སྐུད་དག་མངོན་པར་རབ་ཏུ་ཕབ་བོ། །ཁ་ཅིག་གིས་ནི་མུ་ཏིག་གི་དོ་ཤལ་དག་མངོན་པར་རབ་ཏུ་ཕབ་བོ། །ཁ་ཅིག་གིས་ནི་དཔུང་རྒྱན་གྱི་རྒྱན་དག་མངོན་པར་རབ་ཏུ་ཕབ་བོ། །ཁ་ཅིག་གིས་ནི་རས་དང་། རས་བཅོས་བུ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱི་ཆར་མངོན་པར་རབ་ཏུ་ཕབ་སྟེ།
en: To worship the blessed thus-gone Śākyamuni and his bodhisattvas, others showered a rain of silver powder, and still others showered rains of perfumed powders, pearls, gold threads, pearl necklaces, armlets, cotton, fine fabrics, parasols, banners, and flags.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདི་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་པར་གྱུར་ཏོ།
en: All of them circumambulated this buddha realm of Sahā three times and then sat to one side.

source: །ཐེག་པ་ཆེན་པོ་འདུས་པ་ཆེན་པོའི་མདོ་ཉི་མའི་སྙིང་པོའི་ལེའུ་ལས། ཕོ་ཉའི་ལེའུ་སྟེ་གཉིས་པ་རྫོགས་སོ།། །།
en: This concludes the chapter called “The Messengers,” the second chapter in “The Quintessence of the Sun,” the Great Vehicle discourse of The Great Assembly.

source: རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོས་སྔོན་མ་མཐོང་བ་ཚངས་པ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། སྲེད་མེད་ཀྱི་བུ་དང་། གླིང་བཞི་པའི་འཁོར་ལོས་སྒྱུར་བ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་མཐོང་ནས་མཆོག་ཏུ་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: The Dhāraṇī Mantras Chapter Three When King Bimbisāra saw the unprecedented sight of innumerable and limitless numbers of mahābrahmās, Śakras, Nārāyaṇas, and universal monarchs ruling over the four continents, he was utterly amazed.

source: སྟན་ལས་ལངས་ནས་ཧ་ཅང་ཡང་ཐག་མི་རིང་བར་འདུག་གོ།
en: He stood up and went close to them.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཕོ་ཉ་བཞི་པོ་དེ་དག་འཁོར་དང་བཅས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་རབ་ཏུ་བཏུད་ནས་འཁོད་དོ།
en: Next, together with their retinues, the bodhisattva great beings—the four messengers of the buddhas—sat down and bowed with their palms joined together in the direction of the thus-gone Śākyamuni.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེ་ལོགས་སུ་མེ་ཏོག་ཙམ་པ་ཀའི་ཕྲེང་བ་དག་གཏོར་ཏེ་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་གསོལ་ཏོ།
en: The bodhisattva great being Quintessence of the Sun’s Energy then tossed garlands of campaka flowers in the direction of the thus-gone Śākyamuni and uttered these verses:

source: །རྐང་གཉིས་དམ་པ་འགྲོ་བའི་སྣང་བ་འཛིན།
en: “Sublime human, you hold the light that illuminates beings,

source: །ལྟ་བ་ཉམས་པའི་འགྲོ་བའི་ལམ་སྩོལ་བ།
en: And you show the path to those who have corrupt views.

source: །མཉམ་ཉིད་ལྡན་པ་འགྲོ་ལ་ཕན་མཛད་ཁྱོད།
en: Endowed with the view of sameness, you benefit beings

source: །བདུད་དང་ཀླུ་རྣམས་མྱུར་དུ་འདུལ་མཛད་ཁྱོད།
en: And swiftly subjugate māras and nāgas.

source: །གདུལ་དཀའ་འགྲོ་བ་ཉོན་མོངས་ཐར་མཛད་ཁྱོད།
en: “You liberate from their afflictions beings who are hard to tame,

source: །ཆོས་འདིར་སྣང་བ་ཡུན་རིང་འབར་མཛད་ཁྱོད།
en: And you cause the light of the Dharma to blaze for a long time in this world.

source: །བསམ་གཏན་སྒོ་འདི་དག་གིས་སྐྱེས་མཆོག་ལྡན། །ཞིང་མང་ཐམས་ཅད་ཤིན་ཏུ་མཛེས་པར་མཛད།
en: Supreme being, you beautify all the many realms With these gateways of concentration.

source: །རྒྱལ་བ་སྐྱེས་མཆོག་སྐྱེ་བོ་མཁས་དགུ་ལ།
en: “Victor, supreme being, many wise ones

source: །རྒྱང་རིང་ནས་ནི་ཞིང་འདི་བརྗོད་པར་མཛད།
en: Speak about this realm from far away.

source: །འགྲོ་བའི་ཆོས་ཀྱི་དུས་འདི་དཀའ་བ་སྟེ།
en: This time for beings to receive the Dharma is hard to attain;

source: །དེ་མཐོང་བདག་འདིར་ཆོས་ཆེད་ཚོགས་སུ་མཆིས།
en: Seeing this, we have joined this assembly for the sake of the Dharma.

source: །འགྲོ་བ་མིར་སྐྱེ་བ་ནི་རྙེད་པར་དཀའ།
en: “It is difficult to achieve a human birth,

source: །ཤིན་ཏུ་རིང་ནས་མིར་སྐྱེ་རྙེད་ནས་ཀྱང་།
en: And even those who have obtained a human body for a very long time

source: །ཉོན་མོངས་ཆེན་པོས་ཟིན་གྱུར་ཐུབ་ཁྱོད་ནི།
en: Are seized by severe afflictions;

source: །རབ་མྱུར་ཉོན་མོངས་དྲ་བ་གཅོད་མཛད་ལགས།
en: Great sage, please quickly sever the web of the afflictions!

source: །སྡུག་བསྔལ་མཚོ་དང་ཉོན་མོངས་ཀླུང་ལྷུང་བ། །ཁྱོད་ཀྱིས་གླང་ཆེན་ལྟ་བུར་འགྲོ་བ་བསྒྲལ།
en: “Like a great elephant, you liberate beings who have fallen Into the ocean of suffering and the river of the afflictions.

source: །རྒྱལ་བས་ཕན་ཚུན་བདག་ཅག་ཕོ་ཉར་མངགས།
en: The victors have sent us here as messengers

source: །ཁྱོད་ཀྱིས་ཆོས་ཀྱི་གཏེར་ལ་ཡི་རང་མཛད།
en: As they rejoice in your Dharma treasure.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་ཤར་ཕྱོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་དཔག་ཏུ་མ་མཆིས་པའི་བྱེ་མ་སྙེད་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་མ་དྲོས་པ་ཞེས་བགྱི་བ་མཆིས་སོ། །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཙམ་པ་ཀའི་མདོག་ཅེས་བགྱི་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: “Respected Blessed One, in the eastern direction, beyond countless buddha realms as numerous as the grains of sand in countless Ganges Rivers, there is a world called Absence of Heat, where the thus-gone, worthy, perfect Buddha Campaka Color resides, thrives, lives well, and teaches the Dharma.

source: །དེ་བཞིན་གཤེགས་པ་དེས་བདག་འདིར་མངགས་ལགས་ཏེ།
en: That thus-gone one has sent me here.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཁྱོད་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་སེམས་ཅན་རྣམས་ཀྱི་ལས་འབྱང་བའི་གཟུངས་སྔགས་འདི་འཆད་པ་ལ་དད་པ་སྦྱིན་པར་མཛད་ཅིང་གནོད་པ་ཆུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། སྟོབས་དང་བདེ་བ་ལ་རེག་པ་ལ་གནས་སམ་ཞེས་ཀྱང་ཞུ་བར་མཛད་ལགས་ན་བཅོམ་ལྡན་འདས་ཅི་བསྙུང་བ་མི་མངའ་ལགས་སམ། གནོད་པ་ཆུང་ལགས་སམ།
en: He puts faith in the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the domain of the nāgas, the dhāraṇī mantra expounded by you that cleanses the karmic actions of sentient beings, and he enquires whether you have any ills or problems and whether you are healthy and well. Respected Blessed One, are you in good health and free from ills?

source: ཁྱོད་ཀྱི་འཁོར་བྲོ་འཚལ་བ་མ་མཆིས་ལགས་སམ། གནོད་པ་ཆུང་ལགས་སམ།
en: Are the members of your retinue comfortable and free from ills?

source: ཆོས་ཉན་པར་འཚལ་བ་དག་ལགས་སམ།
en: Are they eager to listen to the Dharma?

source: ཆོས་ཀྱིས་གནས་པས་གནས་པར་བགྱིད་པ་ལགས་སམ།
en: Do they abide by the Dharma?

source: ཁྱོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་བདུད་ཀྱི་ཡུལ་དང་ཀླུའི་ཡུལ་བཅོམ་ལགས་སམ།
en: Are the domains of the māras and nāgas subjugated in your buddha realm?

source: འདི་ན་ཐོགས་པ་མ་མཆིས་པར་འཁོར་ལོ་སྐོར་ལགས་སམ།
en: Are you turning the Dharma wheel without obstruction in this place?

source: སངས་རྒྱས་ཀྱི་ཡུལ་འདི་ན་གང་སུ་དག་འཁོར་ལོ་སྐོར་བར་འགྱུར་བ་དེ་དག་གི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་དེ་ཁྱོད་དང་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ། ཀླུའི་ཡུལ་འཇིག་པའི་འོད་ཟེར་གྱི་ལེའུ་གཟུངས་སྔགས་འདི་ལ་དད་པ་སྦྱིན་པར་མཛད་ལགས་སོ།
en: “For the sake of those who will turn the wheel in this buddha realm, the thus-gone Campaka Color puts faith in you and in this practice of the Dharma of The Quintessence of the Sun, the dhāraṇī mantra of the section on the light rays that destroy the domain of the nāgas.

source: །དེ་ནས་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་མཐུ་ཆེ་བ། ཕན་ཡོན་ཆེ་བ།
en: He confers this powerful and beneficial dhāraṇī mantra that accords with the truth.

source: འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཟད་པར་བགྱིད་པ། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་ཟད་པར་བགྱིད་པ། གཟུགས་མེད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཟད་པར་བགྱིད་པ། ང་རྒྱལ་དང་། ལྷག་པའི་ང་རྒྱལ་དང་། ངའོ་སྙམ་པའི་ང་རྒྱལ་ཐམས་ཅད་ཟད་པར་བགྱིད་པ་འདི་ཡང་བསྐུར་ལགས་སོ་ཞེས་བྱ་བ་ཇི་ལྟར་སྔར་བཤད་པ་བཞིན་ཏེ། བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་འདི་ནི་བདུད་རྣམས་ཚར་གཅོད་པ། ཀླུ་རྣམས་ཕམ་པར་བགྱིད་པ།
en: It exhausts all forms of attachment associated with the desire realm, the form realm, and the formless realm, as well as pride, special pride, and pride that thinks ‘I am.’ This acceptance that accords with the truth annihilates all māras and vanquishes the nāgas.

source: ལྷ་རྣམས་དགའ་བར་བགྱིད་པ། གནོད་སྦྱིན་རྣམས་ཚིམ་པར་བགྱིད་པ། ལྷ་མ་ཡིན་རྣམས་རྣམ་པར་འཇོམས་པར་བགྱིད་པ། རྗེའུ་རིགས་རྣམས་དགའ་བར་བགྱིད་པ། དམངས་རིགས་རྣམས་མཆོག་ཏུ་དགའ་བར་བགྱིད་པ།
en: It pleases the gods, it satisfies the yakṣas, it overcomes the asuras, it pleases the vaiśyas, and it delights the śūdras.

source: བུད་མེད་རྣམས་འདོད་ཆགས་དང་བྲལ་བར་བགྱིད་པ། མང་དུ་ཐོས་པ་རྣམས་སྐྱོ་བར་བགྱིད་པ། རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་མངོན་པར་དགའ་བར་བགྱིད་པ། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ། འཐབ་པ་དང་། འཐབ་མོ་དང་། མུ་གེ་དང་། དུས་མ་ཡིན་པའི་ནད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། རླུང་དང་། ཆར་པ་དང་། ཆུ་བོ་དང་། གྲང་བ་དང་། དྲོ་བ་ཐམས་ཅད་རྣམ་པར་ཞི་བར་བགྱིད་པ། ཁ་བ་དང་། ཚ་བ་དང་། རོ་མི་བྲོ་བ་དང་། རྩུབ་པ་དང་། ཧྲུད་ཧྲུད་པོ་དང་། རེག་པར་དཀའ་བའི་དངོས་པོ་རྣམས་རབ་ཏུ་ཞི་བར་བགྱིད་པ།
en: It liberates women from their desires, it induces weariness in the scholars, it delights the spiritual practitioners, it completely pacifies all diseases, quarrels, fights, famines, untimely sicknesses, hostile armies, wind, rains, rivers, cold, heat, snow, and heat waves, and it softens unsavory tastes and substances that are harsh, rough, and hard to touch.

source: ཆོས་ཀྱི་ཚུལ་འབར་བར་བགྱིད་པ། ཆོས་ཀྱི་ཚུལ་རྒྱུན་མི་འཆད་པར་བགྱིད་པ། སངས་རྒྱས་ཀྱི་བསྟན་པ་སྟོན་པར་བགྱིད་པ།
en: It causes the way of the Dharma to blaze, it reveals the teachings of the buddhas, and it ensures that the lineage of the Three Jewels remains uninterrupted.

source: འཁོར་བས་སྐྲག་པ་རྣམས་དབུགས་འབྱིན་པར་བགྱིད་པ། ཟད་པ་ཤེས་པ་སྐྱེ་བར་བགྱིད་པ། མི་སྐྱེ་བ་ཤེས་པ་རྟོགས་པར་བགྱིད་པ། མ་རིག་པའི་མུན་པའི་ཕུང་པོ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པར་བགྱིད་པ། སྡུག་བསྔལ་གྱི་ཁུར་འདོར་བར་བགྱིད་པ། སྲེད་པའི་ཀླུང་སྐེམས་པར་བགྱིད་པ་འདི་ཡང་བསྐུར་ལགས་ཏེ།
en: It provides relief to those who are afraid of saṃsāra, generates the knowledge of exhaustion, causes one to realize the knowledge of the unborn, overcomes all the dense darkness of ignorance, removes the burden of suffering, and dries up the river of craving.

source: ཏད་ཡ་ཐཱ། བཱ་ཡེ་བ་ཡ་པ་རི་བཱ་རེ། བ་ཧེ་བ་ཧ་པ་རི་བཱ་རེ། པྲྀ་ཐ་བི་པ་རི་བཱ་རེ། ཨ་བེ་ཨ་བ་པ་རི་བཱ་རེ། ཏེ་ཛེ་ཏེ་ཛ་པ་རི་བཱ་རེ། མ་ལེ་མ་ལ་པ་རི་བཱ་རེ། ཁ་གྷེ་ཁ་གྷ་པ་རི་བཱ་རེ། ཨཱ་ལོ་ཀེ་ཨཱ་ལོ་ཀ་པ་རི་བཱ་རེ། སྠ་མེ་སྠ་མ་པ་རི་བཱ་རེ། རཱ་ཛེ་རཱ་ཛ་པ་རི་བཱ་རེ། སི་ལི་སི་ལ་པ་རི་བཱ་རེ། ག་མེ་ག་མ་པ་རི་བཱ་རེ། ཨ་བོ་ཙ་ཨ་བོ་ཙ་པ་རི་བཱ་རེ། མ་ལ་མ་ལ་ལ་མ་ལ་མེ་ལ་མ། རཱ་ལ་རཱ་ལ་ལ་མ། བིདྱཱ་ཛྙཱ་ན་མ་བྷུ་ཏཾ་ག་མེ། བྷུ་ཏང་ག་མ་པ་རི་བཱ་རེ། ཙཀྵུ་གྲ་ཧེ། ཙཀྵུ་གྲ་ཧ་པ་རི་བཱ་རེ། ཤོ་ཏྲ་གྲ་ཧེ། ཤོ་ཏྲ་གྲ་ཧ་པ་རི་བཱ་རེ། གྷྲཱ་ཎ་གྲ་ཧེ། གྷྲཱ་ཎ་གྲ་ཧ་པ་རི་བཱ་རེ། ཛི་ཧྭ་གྲ་ཧེ། ཛི་ཧྭ་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཀཱ་ཡ་གྲ་ཧེ། ཀཱ་ཡ་གྲ་ཧ་པ་རི་བཱ་རེ། མ་ན་གྲ་ཧེ། མ་ན་གྲ་ཧ་པ་རི་བཱ་རེ། སྤར་ཤ་གྲ་ཧེ། སྤར་ཤ་གྲ་ཧ་པ་རི་བཱ་རེ། བེ་ད་ན་གྲ་ཧེ། བེ་ད་ན་གྲ་ཧ་པ་རི་བཱ་རེ། ཏྲི་ཥྞཱ་གྲ་ཧེ། ཏྲི་ཥྞཱ་གྲ་ཧ་པ་རི་བཱ་རེ། ཨུ་པཱ་དཱ་ན་གྲ་ཧེ། ཨུ་པཱ་དཱ་ན་གྲ་ཧ་པ་རི་བཱ་རེ། བྷཱ་བ་གྲ་ཧེ། བྷཱ་བ་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཛཱ་ཏི་གྲ་ཧེ། ཛཱ་ཏི་གྲ་ཧ་པ་རི་བཱ་རེ། ཛ་ར་མ་ར་ཎ་གྲ་ཧེ། ཛ་ར་མ་ར་ཎ་གྲ་ཧཱ་པ་རི་བཱ་རེ། དུཿཁ་སན་ཏ་པཱ་གྲ་ཧེ། དུཿཁ་སན་ཏ་པཱ་གྲ་ཧ་པ་རི་བཱ་རེ། ཨཱ་རཱ་པཱ་རཱ་དྷྭ་ཛེ་གྲ་ཧེ། ཨཱ་རཱ་པཱ་རཱ་དྷྭ་ཛ་གྲ་ཧ་པ་རི་བཱ་རེ། ཨཱ་རཱ་པཱ་རཱ་དྭི་ཛ་གྲ་ཧེ། ཨཱ་རཱ་བཱ་རཱ་དྭི་ཛཾ་གྲ་ཧཱ་པ་རི་བཱ་རེ། ཨ་བརྟ་བི་བརྟ་སྱ། ཨ་བ་ར་མུ་པ་མཱ་སྭ་སྱ། བེ་ག་བི་ནི་བརྟ། ཨཱ་རྱ་ར་སྨི་ས་མ་བེ་ག་ཤཱ་ན་ཏི་སྭཱ་ཧཱ།
en: tadyathā: vāyevayaparivāre vahevahaparivāre pṛthāviparivāre āve avaparivāre tejetejaparivāre mālemalaparivāre khagekhagaparivāre āloke ālokaparivāre sthama sthamaparivāre rājerājaparivāre silisilaparivāre gamegamaparivāre āvoca avocaparivāre malamalalamalamelama rālarālalama vidyājñāna­bhutaṃgame bhutaṅgama­parivāre cakṣugrahe cakṣugrahaparivāre śotragrahe śotragraha­parivāre ghrāṇagrahe ghrāṇagraha­parivāre jihvāgrahe jihva­grahāparivāre kāyagrahe kāyagraha­parivāre managrahe managraha­parivāre sparśagrahe sparśagraha­parivāre vedanagrahe vedana­graha­parivāre tṛṣṇāgraha tṛṣṇāgraha­parivāre upādāna­grahe upādānagraha­parivāre bhāvagrahe bhāva­grahāparivāre jātigrahe jātigraha­parivāre jaramaraṇgrahe jaramaraṇa­grahāparivāre duḥkha­santapāgrahe duḥkha­santapāgraha­parivāre ārāpārādvaje­grahe ārāpārādvaja­grahāparivāre ārāpārādhvajegrahe ārāpārādhvajaṃgrahāparivāre ārāpārādvijagrahe ārāpārādvijaṁgrahāparivāre avrtavivrtasya avaramupamāsvasya vegavinivarta ārya­rasmisamvegana­śānati svāhā.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་དེས་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་བསྐུར་བ་ནི་འདི་ལགས་སོ།
en: “Respected Blessed One, this is the acceptance that accords with the truth, which was conferred by the thus-gone Campaka Color.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བ་གནང་ངོ་། །སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལྷགས་པས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། བསམ་གཏན་ལ་སྙོམས་པར་ཞུགས་པ་དག་ནི་མ་གཏོགས་སོ།
en: The Blessed One expressed his approval of this, as did the entire retinue that had arrived in the buddha realm of Sahā—all but those who were absorbed in concentration.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདིར་ང་སྟན་འདི་ཉིད་ལ་བཞུགས་བཞིན་སེམས་ཅན་རྣམས་ལ་དོན་དང་བཅས་པ། ཚིག་འབྲུ་དང་བཅས་པ། ལྷག་ཆད་མེད་པའི་བདེན་པ་དང་། རྗེས་སུ་འཐུན་པའི་བཟོད་པ་རྒྱ་ཆེར་སྟོན་པར་མཛད་དོ།
en: Then, the Blessed One said to the bodhisattva great being Quintessence of the Sun’s Energy, “Noble son, while sitting here on this seat, I shall teach extensively to sentient beings, with both meaning and letter and without adding or omitting anything, this acceptance that accords with the truth.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་གིས་གང་ཁྱོད་འདིར་འོང་བའི་ཚེ་བསྲུང་བའི་ཕྱིར་བྱིན་པ་ལུས་ཀྱི་ཁྱད་པར་ཐམས་ཅད་སྒྲུབ་པ་ཞེས་བྱ་བ་ནས། ཤིན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་སྒྲུབ་པ་ཞེས་བྱ་བའི་བར་ཉི་མའི་སྤྱན་པད་མའི་སྦུ་གུའི་གཟུངས་སྔགས་དེ་ཁྱོད་ཀྱིས་ཀྱང་སྟོན་ཅིག །
en: Noble son, please reveal also the dhāraṇī mantra hollow lotus stalk of the sun’s eye, which the thus-gone Campaka Color gave to protect you when you were coming here, the dhāraṇī mantra that accomplishes everything from the unique features of the body up to parinirvāṇa.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that moment, the bodhisattva great being Quintessence of the Sun’s Energy uttered these words:

source: སྱཱད་ཡ་ཐེ་དན། སིད་དྷ་མ་ཏེ། བི་ལོ་ཀ་མ་ཏེ། ཨེ་ལེ་གེ་ཏ་རི་ཤེ །རུ་ཙེ་སུ་རུ་ཙེ། བུད་དྷེ། བི་བུད་དྷེ། མ་ཧཱ་བུད་དྷེ། ཨུན་མད་ཏེ། ཨུན་མད་ཏ་པྲ་ཏི་ཥེ་དྷ་ནེ། ར་ག་དྷྲུ་བ་པྲ་ཏི་ཥེ་དྷ་ནེ། བིན་དུ་བིན་དུ་མ་ཏེ། ཙི་ཏ་ཙི་ཏ་བ་ཏི་ཥེ་དྷ་ནེ། ཨརྐེ་ཙན་དྲ་ཨརྡྷེ། ཧ་ཏ་ཙི་ཏི། ཧ་ཏ་ནི་རྨི། ཧ་ཏ་ཀཱ་མ་བེ་གེ །ཧ་ཏ་པཽ་ན་བྷ་བི་ར་ཛེ། ཧ་ཏ་ཙཀྵུ་ས་མ་ཏེ། ཧ་ཏ་བི་མ་ཏ་མུ་དྲེ། ཧ་ཏ་ཡཱ་གྷེ། ཧ་ཏ་ཡཱ་གྷེ། ཧ་ཏ་ས་མུ་དྲ་ཛ་བེ། ཧ་ཏ་བི་མ་ན་རཱ་ཛེ། ཧ་ཏ་ཧི་ཏེ། ཧ་ཏ་ཙི་ཏ་ཊེ། ཧ་ཏ་དྷརྨ་རཱ་ཛེ། ཧ་ཏ་བ་ཧུ་རཱ་ཛེ། ཧ་ཏ་བརྫ་མ་ཏི། ཧ་ཏ་ཨུ་པ་ག་མ་ཏེ། ཧ་ཏ་རོ་པ་རསྨི། ཧ་ཏ་དྷརྨ་སིད་དྷི། ཧ་ཏ་སརྦོན་མ་ད། ཛྙཱ་ཛྙཱ་ཛྙཱ། བི་ཛྙཱ་ཛྙཱ་ཛྙཱ། སརྦ་མཱརྒ་ཛྙཱ་ཛྙཱ། ཨེ་ཥོ་ན་ད་སྃ་ས་ར་དུཿཁེ་སྭཱ་ཧཱ།
en: syād yathedaṃ: siddhamate vilokamate alegetariśe rucesuruce buddhe vibuddhe mahābuddhe unmadte unmadtapratiṣedhane ragadhruvapratiṣedhane bindubindumate citacitavatiṣedhane arkecandra ardhe hataciti hatanirmi hatakāmavege hatapaunabhaviraje hatacakṣusamate hatavimatamudre hatayāghe hatayāghe hatasamudrajave hatavimanarāje hatahite hatacitaṭe hatadharmarāje hatavahurāje hatavarjamati hata upagamate hataroparasmi hatadharmasiddhi hatasarvonamad jñājñājñā vijñājñājñā sarvamārgajñājñā eṣonadasaṁsaraduḥkhe svāhā.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་དེས་བདག་ཆས་པའི་དུས་ཀྱི་ཚེ་བསྲུང་བའི་སླད་དུ་ཉི་མའི་སྤྱན་པད་མའི་གཟུངས་སྔགས་སྩལ་བ་ནི་འདི་ལགས་སོ།
en: “Respected Blessed One, this is the dhāraṇī mantra lotus of the sun’s eye, which the thus-gone Campaka Color gave to protect me when I departed.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་ཚེ་དང་ལྡན་པ་སྙན་པ་ལ་བཀའ་སྩལ་པ། སྙན་པ་ཁྱོད་ཀྱིས་ཉི་མའི་སྙིང་པོའི་སྤྱན་པད་མའི་གཟུངས་སྔགས་འདི་ཟུང་ཤིག །
en: The blessed Śākyamuni then said to Venerable Yaśas, “Yaśas, remember this dhāraṇī mantra lotus of the sun’s eye!

source: སྙན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བ་རྙེད་པར་དཀའོ། །དེ་བས་ཀྱང་ཉི་མའི་སྤྱན་པད་མའི་གཟུངས་སྔགས་འདི་ཆེས་རྙེད་པར་དཀའོ།
en: Yaśas, it is rare for thus-gone, worthy, perfect buddhas to appear in the world, but it is much more difficult to obtain this dhāraṇī mantra lotus of the sun’s eye.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའམ་དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་ཀྱིས་ཀྱང་རུང་། གང་གིས་ཀྱང་རིའི་རྒྱལ་པོ་རི་རབ་བམ། རྒྱ་མཚོ་ཆེན་པོའི་ཡོན་ཏན་དང་། ཕན་ཡོན་ནི་བརྗོད་པར་ནུས་སོ། །ཉི་མའི་སྤྱན་པད་མའི་གཟུངས་སྔགས་འདིའི་ཡོན་ཏན་དང་ཕན་ཡོན་ནི་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་ཡང་རུང་སྟེ་བརྗོད་པར་མི་ནུས་སོ།
en: Noble son, the thus-gone ones or their hearers could describe the qualities and the benefits related to Mount Sumeru or the great ocean, but they could never fully express the qualities and benefits of this dhāraṇī mantra lotus of the sun’s eye, even if they were to endeavor for eons or more.

source: །ཉི་མའི་སྤྱན་པད་མའི་གཟུངས་སྔགས་འདི་ནི་དེ་ལྟར་ཟབ་པ་ཡིན་ནོ།
en: This dhāraṇī mantra lotus of the sun’s eye is therefore profound!

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཉི་མའི་སྤྱན་པད་མའི་གཟུངས་སྔགས་འདི་ཟུང་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །འཁོར་བཞི་པོ་དེ་དག་ལ་ཡང་རྒྱས་པར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅིག་དང་།
en: Noble son, you must remember this dhāraṇī mantra lotus of the sun’s eye! Comprehend it and teach it on a vast scale to the four assemblies!

source: དེར་སེམས་ཅན་རྣམས་འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་སྤོང་བར་འགྱུར་རོ་ཞེས་བྱ་བ་ནས། ཟག་པ་ཐམས་ཅད་ཟད་པ་དང་། བྱང་གྲོལ་གྱི་བདེ་བ་དང་ལྡན་པའི་བར་དུ་ཡང་འགྱུར་རོ།
en: Thereby, sentient beings’ attachments related to the desire realm will be abandoned, [. . .] all their defilements will be exhausted, and they will experience the happiness of emancipation.”

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྤོས་ཀྱི་གླང་པོ་ཆེས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the bodhisattva great being Gandhahastin uttered these verses:

source: །ཤིང་གི་རྒྱལ་པོའི་དྲུང་དུ་བདུད་ནི་གཅིག་པུ་ཁྱོད་ཀྱིས་བཅོམ།
en: “In front of the king of the trees, you defeated Māra

source: །བྱང་ཆུབ་རབ་མཆོག་དམ་པ་ཡང་ནི་གཅིག་པུས་བརྙེས་པ་ལགས།
en: And achieved supreme awakening on your own.

source: །ལྷ་དང་མི་དང་གནོད་སྦྱིན་གཅིག་པུ་ཁྱོད་ཀྱིས་དབང་དུ་མཛད།
en: Alone, you have subjugated gods, humans, and yakṣas.

source: །རྒྱལ་བ་ཉི་མ་རབ་གྲོལ་ཡེ་ཤེས་མཆོག་གི་འོད་ཟེར་ལགས།
en: Victor, you are the light rays of the sun’s supreme liberated wisdom.

source: །འདི་ན་མུ་སྟེགས་གཞན་ནི་གཅིག་པུས་འོད་དང་བྲལ་མཛད་པ།
en: “You alone outshine the non-Buddhists in this world,

source: །འཇིག་རྟེན་ཀུན་ན་སྲིན་བུ་མེ་ཁྱེར་དག་ལ་ཉི་ལྟར་མཛེས།
en: And you beautify the entire world, like the sun compared to a firefly.

source: །ཐུབ་པ་འདུས་ན་སེམས་ཅན་བསྒྲལ་བའི་དོན་ཀྱང་མཛད་ལགས་ཏེ།
en: Great sage, you liberate sentient beings within your assembly,

source: །དཀོན་མཆོག་གསུམ་གྱི་གདུང་དང་ཆོས་ཚུལ་ཡུན་རིང་གནས་པར་མཛད།
en: And you ensure that the lineage of the Three Jewels and the Dharma way endure for a long time.

source: །ཁྱོད་གཅིག་པུ་ལ་མཆོད་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལྷགས་པ།
en: “Bodhisattvas who have arrived to worship you alone

source: །དགེ་དང་བྱང་ཆུབ་ཡོངས་སུ་བཙལ་ཕྱིར་ཆོས་དོན་གཉེར་བ་ལགས།
en: Strive for the Dharma in the pursuit of virtue and awakening.

source: །རྒྱལ་བ་ཁྱོད་ནི་སྡུག་བསྔལ་ཐམས་ཅད་གཅོད་པའི་ཆོས་སྟོན་པ།
en: Victor, you teach the Dharma that eliminates all suffering,

source: །ཁྱོད་ནི་ཡེ་ཤེས་བྱང་ཆུབ་སྤྱོད་པ་རབ་མཆོག་སྟོན་པར་མཛད།
en: And you reveal the supreme conduct of awakened wisdom.

source: །གཅིག་པུས་ཞི་འགྱུར་བདུད་རྩིས་སེམས་ཅན་རྣམས་ཀྱང་ཞི་མཛད་པ།
en: “You alone appease sentient beings through your pacifying nectar,

source: །ཡང་སྲེད་མ་མཆིས་མཛད་སླད་སྲོག་ཆགས་ཁྲག་ཁྲིག་སྒྲོལ་བ་ཁྱོད།
en: And you liberate hundreds of millions of beings to free them from new births.

source: །ཟག་པ་ཟད་ཅིང་ལྟ་དང་བྲལ་བ་ཉོན་མོངས་སྤངས་གྱུར་པ།
en: Your defilements are exhausted, you are free from views, you have abandoned afflictions,

source: །གང་ན་མྱ་ངན་བྱེད་མེད་ཞི་བའི་གྲོང་ཁྱེར་གཤེགས་པ་ཁྱོད།
en: And you have reached the city of peace, where there is no sorrow.

source: །འདི་ནི་འཇིག་རྟེན་ཀུན་ཏུ་ཁྱོད་གཅིག་སྨན་དང་མཚུངས་ལགས་ཏེ།
en: “In the entire world, you are the sole doctor,

source: །རྒྱལ་བ་རྣམས་ཀྱིས་ཁྱོད་ལ་ཞུ་བའི་སླད་དུ་ཕོ་ཉར་མངགས།
en: And the victors have sent us as messengers to ask you questions.

source: །རིག་པའི་རྒྱ་མཚོ་ཐུགས་རྗེ་མཉམ་པས་གནས་པར་མཛད་པ་པོ།
en: You abide by an ocean of knowledge and impartial compassion;

source: །ཐུབ་པ་ཟླ་བའི་ཆོས་དང་གསན་ནས་གཟུངས་ཀྱང་བསྐུར་བ་ལགས།
en: Great sage, listen to this moon-like Dharma, and I will confer a dhāraṇī.
